import { React } from 'react';

import './index.scss';


const Footer = ({tags = ['Политика', 'В мире', 'Экономика', 'Общество', 'Происшествия',
'Религия', 'Политика', 'В мире', 'Экономика']}) => {
    return (
        <footer className='footer'>
            <div className="container">
                <div className="footer__wrapper">
                <div className="footer__main_content">
                    <a href="/" className="footer__logo_wrapper">
                        <svg width="44" height="44" viewBox="0 0 44 44" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fill-rule="evenodd" clip-rule="evenodd" d="M22 0C34.1518 0 44 9.84852 44 22C44 25.5004 43.1809 28.8075 41.7283 31.744C40.5221 34.18 36.9482 33.9646 36.0524 31.4019L29.6981 13.2443C28.7414 10.5106 24.8348 10.5106 23.8781 13.2443L14.849 39.0488C14.1963 40.9114 11.9599 41.678 10.2833 40.62C4.105 36.7269 0 29.8433 0 22C0 9.84852 9.84817 0 22 0ZM31.765 37.0373C33.4191 38.504 33.0128 41.1744 30.9907 42.0835C28.2455 43.3158 25.2027 44 22 44C21.9776 44 21.952 44 21.9296 44C19.1332 43.9905 17.8246 40.5725 19.9075 38.7257L24.7356 34.4461C25.9066 33.4102 27.676 33.4102 28.8438 34.4461L31.765 37.0373Z" fill="#2269F4"/>
                        </svg>
                    </a>
                    <div className="footer__links">
                        <ul className="footer__links_list">
                            <li><h6>Информация</h6></li>
                            <li>
                                <ul>
                                    <li className="footer__link"><a href="/aboutus">О компании</a></li>
                                    <li className="footer__link"><a href="/contacts">Контакты</a></li>
                                    <li className="footer__link"><a href="/redaction">Редакция</a></li>
                                </ul>
                            </li>
                        </ul>
                        <ul className="footer__links_list">
                            <li><h6>Популярные теги</h6></li>
                            <li>
                                <ul>
                                    {
                                        tags.map((tag, i) => {
                                            return <li className="footer__link"><a href={`/search?category=${tag}`}>{tag}</a></li>
                                        })
                                    }
                                </ul>
                            </li>
                        </ul>
                        <ul className="footer__links_list">
                            <li><h6>Юридическая информация</h6></li>
                            <li>
                                <ul>
                                    <li className="footer__link"><a href="/UserAgreement">Пользовательское соглашение</a></li>
                                    <li className="footer__link"><a href="/PrivacyPolicy">Политика конфиденциальности</a></li>
                                    <li className="footer__link"><a href="/SiteMaterials">Правила использования материалов сайта</a></li>
                                    <li className="footer__link"><a href="/Cookies">Правила использования cookies</a></li>
                                </ul>
                            </li>
                        </ul>
                        <ul className="footer__links_list footer__links_list_socials">
                            <li><h6>Мы в соцсетях</h6></li>
                            <li>
                                <ul>    
                                    <li className="footer__link_social footer__link_social_tg">
                                        <a href="#">
                                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M20.665 3.71694L2.935 10.5539C1.725 11.0399 1.732 11.7149 2.713 12.0159L7.265 13.4359L17.797 6.79094C18.295 6.48794 18.75 6.65094 18.376 6.98294L9.843 14.6839H9.841L9.843 14.6849L9.529 19.3769C9.989 19.3769 10.192 19.1659 10.45 18.9169L12.661 16.7669L17.26 20.1639C18.108 20.6309 18.717 20.3909 18.928 19.3789L21.947 5.15094C22.256 3.91194 21.474 3.35094 20.665 3.71694V3.71694Z" fill="white"/>
                                            </svg>
                                        </a>
                                    </li>
                                    <li className="footer__link_social footer__link_social_ok">
                                        <a href="#">
                                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M11.9861 12.341C9.16109 12.341 6.81309 9.995 6.81309 7.219C6.81309 4.347 9.16109 2 11.9871 2C14.9091 2 17.1601 4.346 17.1601 7.219C17.1551 8.58205 16.609 9.88733 15.642 10.848C14.675 11.8086 13.3661 12.346 12.0031 12.342L11.9861 12.341V12.341ZM11.9861 5.017C10.7901 5.017 9.88009 6.022 9.88009 7.22C9.88009 8.416 10.7901 9.326 11.9871 9.326C13.2321 9.326 14.0941 8.416 14.0941 7.22C14.0951 6.021 13.2321 5.017 11.9861 5.017ZM14.0461 16.603L16.9691 19.428C17.5441 20.049 17.5441 20.959 16.9691 21.534C16.3471 22.155 15.3881 22.155 14.9091 21.534L11.9871 18.661L9.16109 21.534C8.87409 21.821 8.49009 21.964 8.05809 21.964C7.72309 21.964 7.34009 21.82 7.00409 21.534C6.42909 20.959 6.42909 20.049 7.00409 19.427L9.97409 16.602C8.90152 16.2844 7.87262 15.8346 6.91109 15.263C6.19209 14.88 6.04909 13.923 6.43209 13.204C6.91109 12.486 7.77309 12.295 8.54009 12.774C9.57868 13.4078 10.7719 13.7431 11.9886 13.7431C13.2053 13.7431 14.3985 13.4078 15.4371 12.774C16.2041 12.295 17.1131 12.486 17.5441 13.204C17.9761 13.923 17.7831 14.879 17.1121 15.263C16.2031 15.838 15.1491 16.269 14.0471 16.604L14.0461 16.603V16.603Z" fill="white"/>
                                            </svg>
                                        </a>
                                    </li>
                                    <li className="footer__link_social footer__link_social_vk">
                                        <a href="#">
                                            <svg width="21" height="12" viewBox="0 0 21 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M19.579 0.85495C19.719 0.38995 19.579 0.0489502 18.917 0.0489502H16.724C16.166 0.0489502 15.911 0.343951 15.771 0.667951C15.771 0.667951 14.656 3.38695 13.076 5.14995C12.566 5.66295 12.333 5.82495 12.055 5.82495C11.916 5.82495 11.714 5.66295 11.714 5.19795V0.85495C11.714 0.29695 11.553 0.0489502 11.088 0.0489502H7.642C7.294 0.0489502 7.084 0.30695 7.084 0.55295C7.084 1.08095 7.874 1.20295 7.955 2.69095V5.91895C7.955 6.62595 7.828 6.75495 7.548 6.75495C6.805 6.75495 4.997 4.02595 3.924 0.90195C3.715 0.29495 3.504 0.0499506 2.944 0.0499506H0.752C0.125 0.0499506 0 0.344951 0 0.668951C0 1.25095 0.743 4.13095 3.461 7.93995C5.273 10.541 7.824 11.951 10.148 11.951C11.541 11.951 11.713 11.638 11.713 11.0979V9.13195C11.713 8.50595 11.846 8.37995 12.287 8.37995C12.611 8.37995 13.169 8.54395 14.47 9.79695C15.956 11.283 16.202 11.95 17.037 11.95H19.229C19.855 11.95 20.168 11.6369 19.988 11.0189C19.791 10.4039 19.081 9.50895 18.139 8.44995C17.627 7.84595 16.862 7.19595 16.629 6.87095C16.304 6.45195 16.398 6.26695 16.629 5.89495C16.63 5.89595 19.301 2.13395 19.579 0.85495V0.85495Z" fill="white"/>
                                            </svg>
                                        </a>
                                    </li>
                                </ul>
                            </li>
                        </ul>
                    </div>
                </div>
                <div className="footer__licence">© АО «Название», 2000–2022. Сообщения и материалы сетевого издания «ААА» (зарегистрировано Федеральной службой по надзору в сфере связи, информационных технологий и массовых коммуникаций (Роскомнадзор) 03.12.2021 за номером ЭЛ №ФС77-282718) сопровождаются пометкой «ААА».                
                </div>
                </div>
            </div>
        </footer>
    );
}

export default Footer